----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Linear-1                 [-1, 8192]       2,105,344
              ReLU-2                 [-1, 8192]               0
            Conv2d-3            [-1, 512, 4, 4]       2,359,296
       BatchNorm2d-4            [-1, 512, 4, 4]           1,024
         LeakyReLU-5            [-1, 512, 4, 4]               0
            Conv2d-6            [-1, 512, 4, 4]       2,359,296
       BatchNorm2d-7            [-1, 512, 4, 4]           1,024
         LeakyReLU-8            [-1, 512, 4, 4]               0
   _Residual_Block-9            [-1, 512, 4, 4]               0
         Upsample-10            [-1, 512, 8, 8]               0
           Conv2d-11            [-1, 256, 8, 8]         131,072
           Conv2d-12            [-1, 256, 8, 8]       1,179,648
      BatchNorm2d-13            [-1, 256, 8, 8]             512
        LeakyReLU-14            [-1, 256, 8, 8]               0
           Conv2d-15            [-1, 256, 8, 8]         589,824
      BatchNorm2d-16            [-1, 256, 8, 8]             512
        LeakyReLU-17            [-1, 256, 8, 8]               0
  _Residual_Block-18            [-1, 256, 8, 8]               0
         Upsample-19          [-1, 256, 16, 16]               0
           Conv2d-20          [-1, 128, 16, 16]          32,768
           Conv2d-21          [-1, 128, 16, 16]         294,912
      BatchNorm2d-22          [-1, 128, 16, 16]             256
        LeakyReLU-23          [-1, 128, 16, 16]               0
           Conv2d-24          [-1, 128, 16, 16]         147,456
      BatchNorm2d-25          [-1, 128, 16, 16]             256
        LeakyReLU-26          [-1, 128, 16, 16]               0
  _Residual_Block-27          [-1, 128, 16, 16]               0
         Upsample-28          [-1, 128, 32, 32]               0
           Conv2d-29           [-1, 64, 32, 32]           8,192
           Conv2d-30           [-1, 64, 32, 32]          73,728
      BatchNorm2d-31           [-1, 64, 32, 32]             128
        LeakyReLU-32           [-1, 64, 32, 32]               0
           Conv2d-33           [-1, 64, 32, 32]          36,864
      BatchNorm2d-34           [-1, 64, 32, 32]             128
        LeakyReLU-35           [-1, 64, 32, 32]               0
  _Residual_Block-36           [-1, 64, 32, 32]               0
         Upsample-37           [-1, 64, 64, 64]               0
           Conv2d-38           [-1, 32, 64, 64]           2,048
           Conv2d-39           [-1, 32, 64, 64]          18,432
      BatchNorm2d-40           [-1, 32, 64, 64]              64
        LeakyReLU-41           [-1, 32, 64, 64]               0
           Conv2d-42           [-1, 32, 64, 64]           9,216
      BatchNorm2d-43           [-1, 32, 64, 64]              64
        LeakyReLU-44           [-1, 32, 64, 64]               0
  _Residual_Block-45           [-1, 32, 64, 64]               0
         Upsample-46         [-1, 32, 128, 128]               0
           Conv2d-47         [-1, 32, 128, 128]           9,216
      BatchNorm2d-48         [-1, 32, 128, 128]              64
        LeakyReLU-49         [-1, 32, 128, 128]               0
           Conv2d-50         [-1, 32, 128, 128]           9,216
      BatchNorm2d-51         [-1, 32, 128, 128]              64
        LeakyReLU-52         [-1, 32, 128, 128]               0
  _Residual_Block-53         [-1, 32, 128, 128]               0
           Conv2d-54          [-1, 3, 128, 128]           2,403
================================================================
Total params: 9,373,027
Trainable params: 9,373,027
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 51.69
Params size (MB): 35.76
Estimated Total Size (MB): 87.44
----------------------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 128, 128]           2,400
       BatchNorm2d-2         [-1, 32, 128, 128]              64
         LeakyReLU-3         [-1, 32, 128, 128]               0
         AvgPool2d-4           [-1, 32, 64, 64]               0
            Conv2d-5           [-1, 64, 64, 64]           2,048
            Conv2d-6           [-1, 64, 64, 64]          18,432
       BatchNorm2d-7           [-1, 64, 64, 64]             128
         LeakyReLU-8           [-1, 64, 64, 64]               0
            Conv2d-9           [-1, 64, 64, 64]          36,864
      BatchNorm2d-10           [-1, 64, 64, 64]             128
        LeakyReLU-11           [-1, 64, 64, 64]               0
  _Residual_Block-12           [-1, 64, 64, 64]               0
        AvgPool2d-13           [-1, 64, 32, 32]               0
           Conv2d-14          [-1, 128, 32, 32]           8,192
           Conv2d-15          [-1, 128, 32, 32]          73,728
      BatchNorm2d-16          [-1, 128, 32, 32]             256
        LeakyReLU-17          [-1, 128, 32, 32]               0
           Conv2d-18          [-1, 128, 32, 32]         147,456
      BatchNorm2d-19          [-1, 128, 32, 32]             256
        LeakyReLU-20          [-1, 128, 32, 32]               0
  _Residual_Block-21          [-1, 128, 32, 32]               0
        AvgPool2d-22          [-1, 128, 16, 16]               0
           Conv2d-23          [-1, 256, 16, 16]          32,768
           Conv2d-24          [-1, 256, 16, 16]         294,912
      BatchNorm2d-25          [-1, 256, 16, 16]             512
        LeakyReLU-26          [-1, 256, 16, 16]               0
           Conv2d-27          [-1, 256, 16, 16]         589,824
      BatchNorm2d-28          [-1, 256, 16, 16]             512
        LeakyReLU-29          [-1, 256, 16, 16]               0
  _Residual_Block-30          [-1, 256, 16, 16]               0
        AvgPool2d-31            [-1, 256, 8, 8]               0
           Conv2d-32            [-1, 512, 8, 8]         131,072
           Conv2d-33            [-1, 512, 8, 8]       1,179,648
      BatchNorm2d-34            [-1, 512, 8, 8]           1,024
        LeakyReLU-35            [-1, 512, 8, 8]               0
           Conv2d-36            [-1, 512, 8, 8]       2,359,296
      BatchNorm2d-37            [-1, 512, 8, 8]           1,024
        LeakyReLU-38            [-1, 512, 8, 8]               0
  _Residual_Block-39            [-1, 512, 8, 8]               0
        AvgPool2d-40            [-1, 512, 4, 4]               0
           Conv2d-41            [-1, 512, 4, 4]       2,359,296
      BatchNorm2d-42            [-1, 512, 4, 4]           1,024
        LeakyReLU-43            [-1, 512, 4, 4]               0
           Conv2d-44            [-1, 512, 4, 4]       2,359,296
      BatchNorm2d-45            [-1, 512, 4, 4]           1,024
        LeakyReLU-46            [-1, 512, 4, 4]               0
  _Residual_Block-47            [-1, 512, 4, 4]               0
           Linear-48                  [-1, 512]       4,194,816
================================================================
Total params: 13,796,000
Trainable params: 13,796,000
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 44.38
Params size (MB): 52.63
Estimated Total Size (MB): 97.19
----------------------------------------------------------------
